
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖

<details><summary>Show Plan</summary>

```
tofu
data.aws_vpc.selected: Reading...
module.ecs.data.aws_iam_policy_document.ecs_task_assume_role_policy: Reading...
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:cluster/mediamind-cluster]
data.aws_secretsmanager_secret_version.creds: Reading...
module.qdrant.aws_cloudwatch_log_group.qdrant: Refreshing state... [id=/ecs/mediamind-qdrant]
module.ecs.aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/mediamind-service]
module.qdrant.data.aws_iam_policy_document.qdrant_task_assume_role_policy: Reading...
module.ecr.aws_ecr_repository.ecr: Refreshing state... [id=ecr-mediamind]
module.s3.aws_s3_bucket.backend: Refreshing state... [id=eutop-mediamind]
module.qdrant.aws_efs_file_system.qdrant: Refreshing state... [id=fs-04611310d7d2b8293]
module.qdrant.data.aws_iam_policy_document.qdrant_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.ecs.data.aws_iam_policy_document.ecs_task_assume_role_policy: Read complete after 0s [id=1077804475]
module.qdrant.aws_iam_role.qdrant_task_execution_role: Refreshing state... [id=mediamind-qdrant-task-execution]
module.redis.aws_elasticache_cluster.redis: Refreshing state... [id=mediamind-redis]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=mediamind-service-ecs-task-execution]
module.qdrant.aws_iam_role_policy_attachment.qdrant_task_execution_role_policy: Refreshing state... [id=mediamind-qdrant-task-execution-20250529181739908900000001]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=mediamind-service-ecs-task-execution-20250529150109931500000002]
data.aws_secretsmanager_secret_version.creds: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:313193269185:secret:mediamind/app-env-fUauFQ|AWSCURRENT]
module.ecs.aws_iam_role_policy.ecs_secrets: Refreshing state... [id=mediamind-service-ecs-task-execution:mediamind-service-secrets]
module.database.aws_db_instance.postgres: Refreshing state... [id=db-O4ZP7T7N6YVLXAW6RB56RS2CBA]
module.qdrant.aws_ecs_task_definition.qdrant: Refreshing state... [id=mediamind-qdrant]
data.aws_vpc.selected: Read complete after 1s [id=vpc-07a194586a2bb7a62]
module.ecs.data.aws_vpc.selected: Reading...
data.aws_subnets.selected: Reading...
module.qdrant.aws_security_group.qdrant: Refreshing state... [id=sg-0f4f72368e2d52623]
module.ecs.aws_security_group.ecs_service: Refreshing state... [id=sg-0cd43e1101e5aa36f]
module.ecs.aws_lb_target_group.ecs: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:targetgroup/mediamind-service-tg/cadbf7f41a821747]
data.aws_subnets.selected: Read complete after 0s [id=eu-central-1]
module.qdrant.aws_efs_mount_target.qdrant["subnet-0910d308a8661b1da"]: Refreshing state... [id=fsmt-0e0a3662e8daddc56]
module.qdrant.aws_efs_mount_target.qdrant["subnet-0f691c9f6c562fab6"]: Refreshing state... [id=fsmt-06b0ba38a3120241e]
module.qdrant.aws_efs_mount_target.qdrant["subnet-0d990bb33ae872102"]: Refreshing state... [id=fsmt-0c39849845d78983d]
module.qdrant.aws_ecs_service.qdrant: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-qdrant]
module.ecs.aws_lb.ecs_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:loadbalancer/app/mediamind-service-alb/622784b324fe8eac]
module.ecs.aws_ecs_task_definition.app: Refreshing state... [id=mediamind-service]
module.ecs.data.aws_vpc.selected: Read complete after 1s [id=vpc-07a194586a2bb7a62]
module.ecs.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-service-alb/622784b324fe8eac/693431dca2c06509]
module.ecs.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:313193269185:listener/app/mediamind-service-alb/622784b324fe8eac/f9e9016768a01582]
module.ecs.aws_ecs_service.app: Refreshing state... [id=arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-service]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # module.database.aws_db_instance.postgres must be replaced
-/+ resource "aws_db_instance" "postgres" {
      ~ address                               = "terraform-20250529150109393600000001.cjs8q4moq2nh.eu-central-1.rds.amazonaws.com" -> (known after apply)
      ~ arn                                   = "arn:aws:rds:eu-central-1:313193269185:db:terraform-20250529150109393600000001" -> (known after apply)
      ~ availability_zone                     = "eu-central-1b" -> (known after apply)
      ~ backup_retention_period               = 0 -> (known after apply)
      ~ backup_target                         = "region" -> (known after apply)
      ~ backup_window                         = "03:12-03:42" -> (known after apply)
      ~ ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> (known after apply)
      + character_set_name                    = (known after apply)
      - customer_owned_ip_enabled             = false -> null
      ~ database_insights_mode                = "standard" -> (known after apply)
      ~ db_subnet_group_name                  = "default" -> (known after apply)
      - deletion_protection                   = false -> null
      - domain_dns_ips                        = [] -> null
      + domain_fqdn                           = (known after apply)
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "terraform-20250529150109393600000001.cjs8q4moq2nh.eu-central-1.rds.amazonaws.com:5432" -> (known after apply)
      ~ engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      ~ engine_version_actual                 = "15.12" -> (known after apply)
      ~ hosted_zone_id                        = "Z1RLNUO7B9Q6NB" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "db-O4ZP7T7N6YVLXAW6RB56RS2CBA" -> (known after apply)
      ~ identifier                            = "terraform-20250529150109393600000001" -> (known after apply)
      ~ identifier_prefix                     = "terraform-" -> (known after apply)
      ~ iops                                  = 0 -> (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      ~ license_model                         = "postgresql-license" -> (known after apply)
      ~ listener_endpoint                     = [] -> (known after apply)
      ~ maintenance_window                    = "sun:22:45-sun:23:15" -> (known after apply)
      ~ master_user_secret                    = [] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      - max_allocated_storage                 = 0 -> null
      + monitoring_role_arn                   = (known after apply)
      ~ multi_az                              = false -> (known after apply)
      + nchar_character_set_name              = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ option_group_name                     = "default:postgres-15" -> (known after apply)
      ~ parameter_group_name                  = "default.postgres15" -> (known after apply)
      ~ password                              = (sensitive value)
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      + replica_mode                          = (known after apply)
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "db-O4ZP7T7N6YVLXAW6RB56RS2CBA" -> (known after apply)
      + snapshot_identifier                   = (known after apply)
      ~ status                                = "available" -> (known after apply)
      - storage_encrypted                     = false -> null
      ~ storage_throughput                    = 0 -> (known after apply)
      ~ storage_type                          = "gp2" -> (known after apply)
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
      + timezone                              = (known after apply)
      ~ username                              = (sensitive value) # forces replacement
      ~ vpc_security_group_ids                = [
          - "sg-0da48096786238162",
        ] -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_service.app will be updated in-place
  ~ resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:eu-central-1:313193269185:service/mediamind-cluster/mediamind-service"
        name                               = "mediamind-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:313193269185:task-definition/mediamind-service:3" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:313193269185:task-definition/mediamind-service:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-central-1:313193269185:task-definition/mediamind-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "AWS_REGION"
                          - value = "eu-central-1"
                        },
                      - {
                          - name  = "AWS_S3_BUCKET_NAME"
                          - value = "eutop-mediamind"
                        },
                      - {
                          - name  = "POSTGRES_SERVER"
                          - value = "terraform-20250529150109393600000001.cjs8q4moq2nh.eu-central-1.rds.amazonaws.com:5432"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "mediamind-redis.72tuoo.0001.euc1.cache.amazonaws.com"
                        },
                    ]
                  - essential        = true
                  - image            = "313193269185.dkr.ecr.eu-central-1.amazonaws.com/ecr-mediamind"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/mediamind-service"
                          - awslogs-region        = "eu-central-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - mountPoints      = []
                  - name             = "mediamind-service"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "APP_CONFIG_JSON"
                          - valueFrom = "arn:aws:secretsmanager:eu-central-1:313193269185:secret:mediamind/app-env-fUauFQ"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "mediamind-service" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>
